#include <stdio.h>                                  //Header file การรับข้อมูลเข้า(input) และแสดงผลออก(Output)

int main() {                                        // จุดเริ่มต้นของโปรแกรม โดยฟังก์ชั่นนี้จะคืนค่า Return เป็นจำนวนเต็ม
    
    printf(" บรรทัดที่ 1 a= %6.3f%%\n" , 0.617);       // แสดงผลโดยให้บรรทัดที่ 1 ให้ a มี = ติดอยู่กับตัวอักษร โดย มีขนาดช่องคือ 6 และแสดงเป็นเลขทศนิยม 3 ตำแหน่ง โดยต้องการแสดง 0.617%
    printf(" บรรทัดที่ 2 b= %4d%%\n" , 25);            // แสดงผลโดยให้บรรทัดที่ 2 ให้ b มี = ติดอยู่กับตัวอักษร โดย มีขนาดช่องคือ 4 และแสดงเป็นเเลขจำนวนเต็ม โดยต้องการแสดง 25%
    printf(" บรรทัดที่ 3 c =%6.3f%%\n" , 19.000);      // แสดงผลโดยให้บรรทัดที่ 3 ให้ c มี = ห่างจากตัวอักษร 1 เว้นวรรค โดย มีขนาดช่องคือ 6 และแสดงเป็นเลขทศนิยม 3 ตำแหน่ง โดยต้องการแสดง 19.000%
    printf(" บรรทัดที่ 4 d  =%-2d%%\n" , 9);           // แสดงผลโดยให้บรรทัดที่ 4 ให้ d มี = ติดอยู่กับตัวอักษร โดย มีขนาดช่องคือ 2 และแสดงเป็นเเลขจำนวนเต็ม โดยต้องการแสดง 9% โดยที่ 9 ชิดซ้าย
    printf(" บรรทัดที่ 5 e=%7.3f%%\n" , 124.555);      // แสดงผลโดยให้บรรทัดที่ 5 ให้ e มี = ติดอยู่กับตัวอักษร โดย มีขนาดช่องคือ 7 และแสดงเป็นเลขทศนิยม 3 ตำแหน่ง โดยต้องการแสดง 124.555% 
    printf(" บรรทัดที่ 6 f=%5.3f%%\n" , 0.001);        // แสดงผลโดยให้บรรทัดที่ 6 ให้ f มี = ติดอยู่กับตัวอักษร โดย มีขนาดช่องคือ 5 และแสดงเป็นเลขทศนิยม 3 ตำแหน่ง โดยต้องการแสดง 0.001%
   
    return 0;                                       // คืนค่า 0 เสร็จสิ้นกระบวนการ
}
